my_list = ['яблоко', 'банан', 'апельсин', 'груша', 'лимон', 'гранат']

print(f'Исходный список:\n{my_list}')
print(f'Первый элемент: {my_list[0]}\nПоследний элемент: {my_list[-1]}')
print(f'Элементы с 3-го по 5-й {my_list[2:5]}')
my_list[2] = 'мандарин'
print(f'Измененный список:\n{my_list}')

print('---------------------')

my_dict = {'яблоко': 'apple',
           'банан': 'banana',
           'апельсин': 'orange',
           'груша': 'pear',
           'лимон': 'lemon',
           'гранат': 'garnet'}

print(f'Исходный словарь\n{my_dict}')
print(f'Перевод слова "банан" - "{my_dict["банан"]}"')
my_dict['огурец'] = 'cucumber'
print(f'Дополненный огурцом словарь)):\n{my_dict}')